Maucke/nexlink/History/STM32/nexlink_adapter/Middlewares/ST/STM32_USB_Device_Library/Class/NEX_LINK/Src/usbd_nex_link.c
static uint8_t USBD_NEX_LINK_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
	UNUSED(cfgidx);

	dbmsg("%s",__FUNCTION__);
	USBD_LL_CloseEP(pdev, GSUSB_ENDPOINT_IN1);
	USBD_LL_CloseEP(pdev, GSUSB_ENDPOINT_OUT1);
	USBD_LL_CloseEP(pdev, GSUSB_ENDPOINT_OUT2);
	USBD_LL_CloseEP(pdev, GSUSB_ENDPOINT_OUT3);

	return USBD_OK;
}

static uint8_t USBD_NEX_LINK_SOF(struct _USBD_HandleTypeDef *pdev)
{
//	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*) pdev->pClassData;
//	hnex->sof_timestamp_us = timer_get();
	dbmsg("%s",__FUNCTION__);
	return USBD_OK;
}

static uint8_t USBD_NEX_LINK_EP0_RxReady(USBD_HandleTypeDef *pdev) {
	BaseType_t xHigherPriorityTaskWoken = pdFALSE;
	struct tm *tm_local;
	char time_str[32];
	dbmsg("%s",__FUNCTION__);
	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*) pdev->pClassData;
//	hnex->TxState = 0;            
	USBD_SetupReqTypedef *req = &hnex->last_setup_request;

	switch (req->bRequest) {

		case NEX_TIMESTAMP_SET:
			memcpy(&hnex->des->timestamp_s, hnex->ep0_buf, sizeof(hnex->des->timestamp_s));
			tm_local = localtime((const time_t *)&hnex->des->timestamp_s); // 转换时间戳
			SYS_SetTime(tm_local);
			SYS_GetTime(tm_local);
			// 格式化时间为字符串
			if (strftime(time_str, sizeof(time_str), "%Y-%m-%d %H:%M:%S", tm_local) != 0) {
					dbmsg("%s", time_str); // 打印时间
			} else {
					dbmsg("Failed to format time");
			}
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;
		case NEX_BRIGHTNESS_SET:
			memcpy(&hnex->des->brides, hnex->ep0_buf, sizeof(hnex->des->brides));
			dbmsg("Brightness: %d\n", hnex->des->brides.brightness); // 打印亮度
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;
		case NEX_SCREEN_SET:
			hnex->gramdetail = 0;//reset pic
			hnex->des->scrdes.direction = ((nex_screen_des*)hnex->ep0_buf)->direction;
			dbmsg("Direction: %d\n", hnex->des->scrdes.direction); // 打印屏幕方向
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;
		case NEX_I2C_INIT:
			I2C_RateAdjust(&hi2c1, ((nex_i2c_init*)hnex->ep0_buf)->baudRate);
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;
		case NEX_I2C:
			memcpy(&hnex->i2cRequest, hnex->ep0_buf, sizeof(hnex->i2cRequest));
			if( xQueueSendFromISR( xQueue_I2c, &( hnex->i2cRequest ), &xHigherPriorityTaskWoken) != pdPASS )
			{
				dbmsg("xQueueSendErr:%ld\n", xHigherPriorityTaskWoken); 
			}
			portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;
		case NEX_UART_RX:
			memcpy(&hnex->uartRequest, hnex->ep0_buf, sizeof(hnex->uartRequest));
			hnex->uartRequest.dir = Rx;
			if( xQueueSendFromISR( xQueue_Uart, &( hnex->uartRequest ), &xHigherPriorityTaskWoken) != pdPASS )
			{
				dbmsg("xQueueSendErr:%ld\n", xHigherPriorityTaskWoken); 
			}
			portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;
		case NEX_UART_TX:
			memcpy(&hnex->uartRequest, hnex->ep0_buf, sizeof(hnex->uartRequest));
			hnex->uartRequest.dir = Tx;
			if( xQueueSendFromISR( xQueue_Uart, &( hnex->uartRequest ), &xHigherPriorityTaskWoken) != pdPASS )
			{
				dbmsg("xQueueSendErr:%ld\n", xHigherPriorityTaskWoken); 
			}
			portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;

		default:
			USBD_NEX_LINK_PrepareReceive(pdev);
			break;
	}

	req->bRequest = 0xFF;
	return USBD_OK;
}

//static uint8_t USBD_NEX_LINK_DFU_Request(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
//{
//	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*) pdev->pClassData;
//	dbmsg("%s",__FUNCTION__);
//	switch (req->bRequest) {

//		case 0: // DETACH request
//			break;

//		case 3: // GET_STATIS request
//			hnex->ep0_buf[0] = 0x00; // bStatus: 0x00 == OK
//			hnex->ep0_buf[1] = 0x00; // bwPollTimeout
//			hnex->ep0_buf[2] = 0x00;
//			hnex->ep0_buf[3] = 0x00;
//			hnex->ep0_buf[4] = 0x00; // bState: appIDLE
//			hnex->ep0_buf[5] = 0xFF; // status string descriptor index
//			USBD_CtlSendData(pdev, hnex->ep0_buf, 6);
//			break;

//		default:
//			USBD_CtlError(pdev, req);

//	}
//	return USBD_OK;
//}

static uint8_t USBD_NEX_LINK_Config_Request(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	LOGData uData;
	BaseType_t xHigherPriorityTaskWoken = pdFALSE;
	nex_log_des logdes = {0};
	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*) pdev->pClassData;

	dbmsg("%s",__FUNCTION__);
	switch (req->bRequest) {
		
		case NEX_SCREEN_SET:
		case NEX_I2C_INIT:
		case NEX_I2C:
		case NEX_UART_INIT:
		case NEX_UART_TX:
		case NEX_UART_RX:
		case NEX_BRIGHTNESS_SET:
		case NEX_TIMESTAMP_SET:
			hnex->last_setup_request = *req;
			USBD_CtlPrepareRx(pdev, hnex->ep0_buf, req->wLength);
			break;
		case NEX_TIMESTAMP_GET:
//			dbmsg("timestamp_s: %d", sizeof(hnex->des->timestamp_s));
			memcpy(hnex->ep0_buf, &hnex->des->timestamp_s, sizeof(hnex->des->timestamp_s));
			USBD_CtlSendData(pdev, hnex->ep0_buf, sizeof(hnex->des->timestamp_s));
			break;
		
		case NEX_BRIGHTNESS_GET:
//			dbmsg("brightness: %d", sizeof(hnex->des->brides.brightness));
			memcpy(hnex->ep0_buf, &hnex->des->brides, sizeof(hnex->des->brides));
			USBD_CtlSendData(pdev, hnex->ep0_buf, sizeof(hnex->des->brides));
			break;
		
		case NEX_SCREEN_GET:
//			dbmsg("screen: %d", sizeof(hnex->des->scrdes));
			memcpy(hnex->ep0_buf, &hnex->des->scrdes, sizeof(hnex->des->scrdes));
			USBD_CtlSendData(pdev, hnex->ep0_buf, sizeof(hnex->des->scrdes));
			break;
		
		case NEX_NAME_GET:
//			dbmsg("screen: %d", sizeof(hnex->des->scrdes));
			memcpy(hnex->ep0_buf, NAME_STR, sizeof(NAME_STR));
			USBD_CtlSendData(pdev, hnex->ep0_buf, sizeof(NAME_STR));
			break;
		
		case NEX_VERSION_GET:
//			dbmsg("screen: %d", sizeof(hnex->des->scrdes));
			memcpy(hnex->ep0_buf, VERSION_STR, sizeof(VERSION_STR));
			USBD_CtlSendData(pdev, hnex->ep0_buf, sizeof(VERSION_STR));
			break;

		case NEX_LOG_GET:
			if(xQueueIsQueueEmptyFromISR(xQueue_Log) == pdFALSE)
			{
				if( xQueueReceiveFromISR( xQueue_Log, &( uData ), &xHigherPriorityTaskWoken) != pdPASS )
				{
					dbmsg("xQueueSendErr:%ld", xHigherPriorityTaskWoken); 
					USBD_CtlError(pdev, req);
				}
				else
				{
					memcpy(hnex->ep0_buf, &uData.timestamp, sizeof(LOGData));
					USBD_CtlSendData(pdev, hnex->ep0_buf, sizeof(LOGData));
				}
				portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
			}
			else USBD_CtlError(pdev, req);
			break;
		case NEX_LOG_SIZE_GET:
			if (xQueueIsQueueFullFromISR(xQueue_Log) != pdFALSE) {
				logdes.isfull = 1;
			}
			logdes.maxsize = QUEUE_MAX_SIZE;
		  logdes.size = uxQueueMessagesWaitingFromISR(xQueue_Log);
			memset(hnex->ep0_buf,0,sizeof hnex->ep0_buf);
			memcpy(hnex->ep0_buf, &logdes, sizeof(logdes));
			USBD_CtlSendData(pdev, hnex->ep0_buf, sizeof(logdes));
			break;
		default:
			USBD_CtlError(pdev, req);
	}

	return USBD_OK;
}


