Maucke/nexlink/History/STM32/nexlink_adapter/Middlewares/ST/STM32_USB_Device_Library/Class/NEX_LINK/Src/usbd_nex_link.c
static uint8_t USBD_NEX_LINK_Vendor_Request(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	dbmsg("%s",__FUNCTION__);
//	uint8_t req_rcpt = req->bmRequest & 0x1F;
//	uint8_t req_type = (req->bmRequest >> 5) & 0x03;

//	if (
//		(req_type == 0x01) // class request
//	 && (req_rcpt == 0x01) // recipient: interface
//	 && (req->wIndex == DFU_INTERFACE_NUM)
//	 ) {
//		return USBD_NEX_LINK_DFU_Request(pdev, req);
//	} else {
		return USBD_NEX_LINK_Config_Request(pdev, req);
//	}
}

bool USBD_NEX_LINK_CustomDeviceRequest(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	uint16_t len = 0;
	uint8_t *pbuf;
	dbmsg("%s",__FUNCTION__);

	if (req->bRequest == USBD_NEX_LINK_VENDOR_CODE) {

		switch (req->wIndex) {

			case 0x0004:
				pbuf = USBD_MS_COMP_ID_FEATURE_DESC;
				len = sizeof(USBD_MS_COMP_ID_FEATURE_DESC);
				USBD_CtlSendData(pdev, pbuf, MIN(len, req->wLength));
				return true;

			case 0x0005:
				if (req->wValue==0) { // only return our GUID for interface #0
					pbuf = USBD_MS_EXT_PROP_FEATURE_DESC;
					len = sizeof(USBD_MS_EXT_PROP_FEATURE_DESC);
					USBD_CtlSendData(pdev, pbuf, MIN(len, req->wLength));
					return true;
				}
				break;

		}
	}

	return false;
}

bool USBD_NEX_LINK_CustomInterfaceRequest(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	dbmsg("%s",__FUNCTION__);
	return USBD_NEX_LINK_CustomDeviceRequest(pdev, req);
}

static uint8_t USBD_NEX_LINK_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
	dbmsg("%s",__FUNCTION__);
	static uint8_t ifalt = 0;
	switch (req->bmRequest & USB_REQ_TYPE_MASK) {

		case USB_REQ_TYPE_CLASS:
		case USB_REQ_TYPE_VENDOR:
			return USBD_NEX_LINK_Vendor_Request(pdev, req);

		case USB_REQ_TYPE_STANDARD:
			switch (req->bRequest) {
				case USB_REQ_GET_INTERFACE:
					USBD_CtlSendData(pdev, &ifalt, 1);
					break;

				case USB_REQ_SET_INTERFACE:
				default:
					break;
			}
			break;

		default:
			break;
	}
	return USBD_OK;
}

static uint8_t USBD_NEX_LINK_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum) {
	dbmsg("%s",__FUNCTION__);
	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;
	
	hnex->txState = false;
	return USBD_OK;
}

static uint8_t USBD_NEX_LINK_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum) {

	dbmsg("%s",__FUNCTION__);
	uint8_t retval = USBD_FAIL;
	BaseType_t xHigherPriorityTaskWoken = pdFALSE;

//	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;

	int rxlen = USBD_LL_GetRxDataSize(pdev, epnum);
	dbmsg("epnum:%d, rxlen: %d", epnum, rxlen);
	xSemaphoreGiveFromISR(xSemaphore_USBDataOut, &xHigherPriorityTaskWoken);
	portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
	USBD_NEX_LINK_PrepareReceive(pdev);
		
	return retval;
}

static uint8_t *USBD_NEX_LINK_GetCfgDesc(uint16_t *len)
{
	dbmsg("%s",__FUNCTION__);
	*len = sizeof(USBD_NEX_LINK_CfgDesc);
	return USBD_NEX_LINK_CfgDesc;
}

inline uint8_t USBD_NEX_LINK_PrepareReceive(USBD_HandleTypeDef *pdev)
{
	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;
	USBD_LL_PrepareReceive(pdev, GSUSB_ENDPOINT_OUT1, (uint8_t*)(hnex->ramBuff1), USB_DATA_MAX_PACKET_SIZE);
	USBD_LL_PrepareReceive(pdev, GSUSB_ENDPOINT_OUT2, (uint8_t*)(hnex->ramBuff2), USB_DATA_MAX_PACKET_SIZE);
	USBD_LL_PrepareReceive(pdev, GSUSB_ENDPOINT_OUT3, (uint8_t*)(hnex->ramBuff1), USB_DATA_MAX_PACKET_SIZE);
	return 0;
}

uint8_t USBD_NEX_LINK_Transmit(USBD_HandleTypeDef *pdev, uint8_t *buf, uint16_t len)
{
	dbmsg("%s",__FUNCTION__);
	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;
	if(!hnex->txState)
	{
		hnex->txState = true;
		USBD_LL_Transmit(pdev, GSUSB_ENDPOINT_IN1, buf, len);
		return USBD_OK;
	}
	else
		return USBD_BUSY;
}

//uint8_t USBD_NEX_LINK_GetProtocolVersion(USBD_HandleTypeDef *pdev)
//{
//	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;
//	if (hnex->timestamps_enabled) {
//		return 2;
//	} else {
//		return 1;
//	}
//}

//uint8_t USBD_NEX_LINK_GetPadPacketsToMaxPacketSize(USBD_HandleTypeDef *pdev)
//{
//	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;
//	return hnex->pad_pkts_to_max_pkt_size;
//}

//uint8_t USBD_NEX_LINK_SendFrame(USBD_HandleTypeDef *pdev, struct nex_host_frame *frame)
//{
//	uint8_t buf[USB_DATA_MAX_PACKET_SIZE],*send_addr;

//	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;
//	size_t len = sizeof(struct nex_host_frame);

//	if (!hnex->timestamps_enabled)
//		len -= 4;

//	send_addr = (uint8_t *)frame;

//	if(hnex->pad_pkts_to_max_pkt_size){
//		// When talking to WinUSB it seems to help a lot if the
//		// size of packet you send equals the max packet size.
//		// In this mode, fill packets out to max packet size and
//		// then send.
//		memcpy(buf, frame, len);

//		// zero rest of buffer
//		memset(buf + len, 0, sizeof(buf) - len);
//		send_addr = buf;
//		len = sizeof(buf);
//	}

//	return USBD_NEX_LINK_Transmit(pdev, send_addr, len);
//}

uint8_t *USBD_NEX_LINK_GetStrDesc(USBD_HandleTypeDef *pdev, uint8_t index, uint16_t *length)
{
	UNUSED(pdev);

	dbmsg("%s",__FUNCTION__);
	switch (index) {
		//case DFU_INTERFACE_STR_INDEX:
			//USBD_GetString(DFU_INTERFACE_STRING_FS, USBD_StrDesc, length);
			//return USBD_StrDesc;
		case 0xEE:
			*length = sizeof(USBD_NEX_LINK_WINUSB_STR);
			return USBD_NEX_LINK_WINUSB_STR;
		default:
			*length = 0;
			USBD_CtlError(pdev, 0);
			return 0;
	}
}

//bool USBD_NEX_LINK_DfuDetachRequested(USBD_HandleTypeDef *pdev)
//{
//	USBD_NEX_LINK_HandleTypeDef *hnex = (USBD_NEX_LINK_HandleTypeDef*)pdev->pClassData;
//	return hnex->dfu_detach_requested;
//}
